renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type2/aws_ota_pal.c
/******************************************************************************
 Private global variables
 ******************************************************************************/
static LOAD_FIRMWARE_CONTROL_BLOCK load_firmware_control_block;

/******************************************************************************
 External functions
 ******************************************************************************/

/*******************************************************************************
 Private global variables and functions
********************************************************************************/
static void ota_firmware_update_request(OTA_FileContext_t * const C);
static void firmware_update_status_initialize(void);
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset);
static uint32_t load_firmware_process(void);
static void flash_load_firmware_callback_function(void *event);
static int16_t file_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset);

/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_CreateFileForRx( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CreateFileForRx" );

    OTA_Err_t eResult = kOTA_Err_Uninitialized; /* For MISRA mandatory. */

    if( C != NULL )
    {
        /* No need for pacFilepath, we write directly to ROM instead of file system
         * But still check for its existence because it is required by AWS */
        if ( C->pucFilePath != NULL )
        {
            flash_spi_erase_info_t Flash_Info_E = {0};
            
            C->pucFile = (uint8_t *)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;
            vSemaphoreCreateBinary(load_firmware_control_block.OTASemaphoreHandle);
            if (load_firmware_control_block.OTASemaphoreHandle == NULL)
            {
                eResult = kOTA_Err_RxFileCreateFailed;
                OTA_LOG_L1( "[%s] ERROR - The semaphore was created fail.\r\n", OTA_METHOD_NAME );
            }
            /* Serial flash initial setting */
            R_FLASH_SPI_Open(0);
            #if 0 /* Setting is required for QSPI Quad communication */
            R_FLASH_SPI_Quad_Enable(0);
            while (FLASH_SPI_SUCCESS_BUSY == R_FLASH_SPI_Polling(0, FLASH_SPI_MODE_REG_WRITE_POLL))
            {
                vTaskDelay(5);
            }
            #endif
            R_FLASH_SPI_Set_Write_Protect(0,0);
            while (FLASH_SPI_SUCCESS_BUSY == R_FLASH_SPI_Polling(0, FLASH_SPI_MODE_REG_WRITE_POLL))
            {
                vTaskDelay(5);
            }
            /* Chip erase */
            Flash_Info_E.addr   = 0;
            Flash_Info_E.mode   = FLASH_SPI_MODE_C_ERASE;
            R_FLASH_SPI_Erase(0, &Flash_Info_E);
            while (FLASH_SPI_SUCCESS_BUSY == R_FLASH_SPI_Polling(0, FLASH_SPI_MODE_ERASE_POLL))
            {
                vTaskDelay(5);
            }
            eResult = kOTA_Err_None;
            OTA_LOG_L1( "[%s] Firmware update initialized.\r\n", OTA_METHOD_NAME );
        }
        else
        {
            eResult = kOTA_Err_RxFileCreateFailed;
            OTA_LOG_L1( "[%s] ERROR - Invalid context provided.\r\n", OTA_METHOD_NAME );
        }
    }
    else
    {
        eResult = kOTA_Err_RxFileCreateFailed;
        OTA_LOG_L1( "[%s] ERROR - Invalid context provided.\r\n", OTA_METHOD_NAME );
    }

    return eResult;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_Abort( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_Abort" );
    
    OTA_LOG_L1("Function call: [%s].\r\n", OTA_METHOD_NAME);

    /* Set default return status to uninitialized. */
    OTA_Err_t eResult = kOTA_Err_Uninitialized;

    if( NULL != C )
    {
        if( NULL != C->pucFile )
        {
            C->pucFile = NULL;
        }
            eResult = kOTA_Err_None;
    }
    else /* Context was not valid. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_FileAbort;
    }

    return eResult;
}
/*-----------------------------------------------------------*/

/* Write a block of data to the specified file. */
int16_t prvPAL_WriteBlock( OTA_FileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pacData,
                           uint32_t ulBlockSize )
{

    DEFINE_OTA_METHOD_NAME( "prvPAL_WriteBlock" );
    int16_t  err = -1;

    err = file_write_process(pacData, (int16_t) ulBlockSize, ulOffset);
    if (err != 0)
    {
        OTA_LOG_L1( "[%s] ERROR - Serial Flash writting FAIL.\r\n", OTA_METHOD_NAME );
        return -1;
    }

    if( (C->ulBlocksRemaining) == 1U)
    {
        load_firmware_control_block.firmware_length = (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);

        R_FLASH_Open();

        /* Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
        firmware_update_status_initialize();

        /* 1st call, Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
        ota_firmware_update_request(C);

        /* 2nd call, Transition to FIRMWARE_UPDATE_STATE_ERASE state
           Execute update firmware write area initialization */
        ota_firmware_update_request(C);

        while(FIRMWARE_UPDATE_STATE_COMPLETED != load_firmware_control_block.status)
        {
            load_firmware_process();
        }
    }
    return 0;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_CloseFile( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CloseFile" );

    /* Note: Updated firmware signature verification not implemented */
    OTA_Err_t eResult = kOTA_Err_None;

    if( C == NULL )
    {
        eResult = kOTA_Err_FileClose;
    }

    if( kOTA_Err_None == eResult )
    {
        if( C->pxSignature != NULL )
        {
            /* Verify the file signature, close the file and return the signature verification result. */
            /* Note: skip Verify the file signature. */
//            eResult = prvPAL_CheckFileSignature( C );
            eResult = kOTA_Err_None;
        }
        else
        {
            eResult = kOTA_Err_SignatureCheckFailed;
        }

        if( eResult == kOTA_Err_None )
        {
//                OTA_LOG_L1( "[%s] %s signature verification passed.\r\n", OTA_METHOD_NAME, pcOTA_JSON_FileSignatureKey );
        }
        else
        {
            OTA_LOG_L1( "[%s] ERROR - Failed to pass %s signature verification: %d.\r\n", OTA_METHOD_NAME,
                        cOTA_JSON_FileSignatureKey, eResult );

