renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type2/aws_ota_pal.c
            /* If we fail to verify the file signature that means the image is not valid. We need to set the image state to aborted. */
            prvPAL_SetPlatformImageState( eOTA_ImageState_Aborted );
        }
    }

    return eResult;
}
/*-----------------------------------------------------------*/


static OTA_Err_t prvPAL_CheckFileSignature( OTA_FileContext_t * const C )
{
    /* Note: Updated firmware signature verification not implemented */
    DEFINE_OTA_METHOD_NAME( "prvPAL_CheckFileSignature" );
    OTA_LOG_L1("[%s] is called.\r\n", OTA_METHOD_NAME);

    /* not implemented */
    return kOTA_Err_SignatureCheckFailed;
}
/*-----------------------------------------------------------*/

static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_ReadAndAssumeCertificate" );

    /* Note: We use the aws_ota_codesigner_certificate.h instead of pucCertName */

    //uint8_t * pucCertData;
    uint32_t ulCertSize = 0U;
    uint8_t * pucSignerCert = NULL;

    OTA_LOG_L1( "[%s] : Using aws_ota_codesigner_certificate.h.\r\n", OTA_METHOD_NAME);

    /* Allocate memory for the signer certificate plus a terminating zero so we can copy it and return to the caller. */
    /// ulCertSize = sizeof( signingcredentialSIGNING_CERTIFICATE_PEM );
    /// pucSignerCert = pvPortMalloc( ulCertSize + 1 );                       /*lint !e9029 !e9079 !e838 malloc proto requires void*. */
    /// pucCertData = ( uint8_t * ) signingcredentialSIGNING_CERTIFICATE_PEM; /*lint !e9005 we don't modify the cert but it could be set by PKCS11 so it's not const. */

    if( pucSignerCert != NULL )
    {
    ///     memcpy( pucSignerCert, pucCertData, ulCertSize );
        /* The crypto code requires the terminating zero to be part of the length so add 1 to the size. */
    ///     pucSignerCert[ ulCertSize ] = 0U;
    ///     *ulSignerCertSize = ulCertSize + 1U;
    }
    else
    {
        OTA_LOG_L1( "[%s] Error: No memory for certificate of size %d!\r\n", OTA_METHOD_NAME, ulCertSize );
    }

    return pucSignerCert;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_ResetDevice( void )
{
    DEFINE_OTA_METHOD_NAME("prvPAL_ResetDevice");

    OTA_LOG_L1( "[%s] Resetting the device.\r\n", OTA_METHOD_NAME );

    /* Software reset issued (Not bank swap) */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.SWRR = 0xa501;
    while(1);   /* software reset */

    /* We shouldn't actually get here if the board supports the auto reset.
     * But, it doesn't hurt anything if we do although someone will need to
     * reset the device for the new image to boot. */
    return kOTA_Err_None;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_ActivateNewImage( void )
{
    DEFINE_OTA_METHOD_NAME("prvPAL_ActivateNewImage");

    OTA_LOG_L1( "[%s] Changing the Startup Bank\r\n", OTA_METHOD_NAME );

    /* reset for self testing */
    vTaskDelay(5000);
    prvPAL_ResetDevice();   /* no return from this function */

    return kOTA_Err_None;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_SetPlatformImageState( OTA_ImageState_t eState )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_SetPlatformImageState" );

    OTA_LOG_L1("Function call: prvPAL_SetPlatformImageState: [%d]\r\n", eState);

    OTA_Err_t eResult = kOTA_Err_None;

    if( eState != eOTA_ImageState_Unknown && eState <= eOTA_LastImageState )
    {
        /* Save the image state to eSavedAgentState. */
        load_firmware_control_block.eSavedAgentState = eState;
    }
    else /* Image state invalid. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid image state provided.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_BadImageState;
    }

    return eResult;
}
/*-----------------------------------------------------------*/

OTA_PAL_ImageState_t prvPAL_GetPlatformImageState( void )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_GetPlatformImageState" );
    OTA_LOG_L1("[%s] is called.\r\n", OTA_METHOD_NAME);

    OTA_PAL_ImageState_t ePalState = eOTA_PAL_ImageState_Unknown;

    switch (load_firmware_control_block.eSavedAgentState)
    {
        case eOTA_ImageState_Testing:
            ePalState = eOTA_PAL_ImageState_PendingCommit;
            break;
        case eOTA_ImageState_Accepted:
            ePalState = eOTA_PAL_ImageState_Valid;
            break;
        case eOTA_ImageState_Unknown: // Uninitialized image state, assume a factory image
            ePalState = eOTA_PAL_ImageState_Valid;
            break;
        case eOTA_ImageState_Rejected:
        case eOTA_ImageState_Aborted:
        default:
            ePalState = eOTA_PAL_ImageState_Invalid;
            break;
    }

    OTA_LOG_L1("Function call: prvPAL_GetPlatformImageState: [%d]\r\n", ePalState);
    return ePalState; /*lint !e64 !e480 !e481 I/O calls and return type are used per design. */
}
/*-----------------------------------------------------------*/

/* Provide access to private members for testing. */
#ifdef AMAZON_FREERTOS_ENABLE_UNIT_TESTS
    #include "aws_ota_pal_test_access_define.h"
#endif

static void ota_firmware_update_request(OTA_FileContext_t * const C)
{
    if(FIRMWARE_UPDATE_STATE_COMPLETED == load_firmware_control_block.status)
    {
        load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_INITIALIZE;
    }
    if(FIRMWARE_UPDATE_STATE_INITIALIZE == load_firmware_control_block.status)
    {
        load_firmware_process();
    }
    if(FIRMWARE_UPDATE_STATE_CAN_SWAP_BANK < load_firmware_control_block.status)
    {
        load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERASE;
    }
}

static void firmware_update_status_initialize(void)
{
    load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_INITIALIZE;
}

/***********************************************************************************************************************
* Function Name: firm_block_read
* Description  :
* Arguments    :
* Return Value :
***********************************************************************************************************************/
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset)
{
    uint32_t current_buf_position = 0;
    uint32_t current_file_position = offset;
    uint8_t * p_buf = (uint8_t *)firmware;

    flash_spi_info_t Flash_Info_R;
    flash_spi_status_t Ret = FLASH_SPI_SUCCESS;

    xSemaphoreTake(load_firmware_control_block.OTASemaphoreHandle, portMAX_DELAY);

    while(1)
    {
        Flash_Info_R.addr   = current_file_position;
        Flash_Info_R.cnt    = SERIAL_FLASH_FIT_SIZE;
        Flash_Info_R.p_data = &p_buf[current_buf_position];
        Flash_Info_R.op_mode = FLASH_SPI_SINGLE;
        Ret = R_FLASH_SPI_Read_Data(0, &Flash_Info_R);
        if (FLASH_SPI_SUCCESS == Ret)
        {
            current_file_position += SERIAL_FLASH_FIT_SIZE;
            current_buf_position += SERIAL_FLASH_FIT_SIZE;
            if((current_buf_position) == FLASH_CF_MEDIUM_BLOCK_SIZE)
            {
                current_file_position = 0;
                break;
            }
        }
        else
        {
            goto firm_block_read_error;
            break;
        }
    }

    xSemaphoreGive(load_firmware_control_block.OTASemaphoreHandle);
    if (FLASH_SPI_SUCCESS != Ret)
    {
firm_block_read_error:
        return -1;
    }

