renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type2/aws_ota_pal.c
    return 0;
}

static uint32_t load_firmware_process(void)
{
    flash_interrupt_config_t cb_func_info;

    switch(load_firmware_control_block.status)
    {
        case FIRMWARE_UPDATE_STATE_INITIALIZE: /* initialize */
            load_firmware_control_block.progress = 0;
            load_firmware_control_block.offset = 0;
            cb_func_info.pcallback = flash_load_firmware_callback_function;
            cb_func_info.int_priority = FLASH_INTERRUPT_PRIORITY;
            R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);
            load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WAIT_START;
            break;
        case FIRMWARE_UPDATE_STATE_WAIT_START: /* wait start */
            /* this state will be changed by other process request using load_firmware_control_block.status */
            break;
        case FIRMWARE_UPDATE_STATE_ERASE: /* erase bank0 (0xFFE00000-0xFFEBFFFF) */
            R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, FLASH_NUM_BLOCKS_CF - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
            load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE;
            break;
        case FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case FIRMWARE_UPDATE_STATE_READ_WAIT_COMPLETE:
            if(!firm_block_read(load_firmware_control_block.flash_buffer, load_firmware_control_block.offset))
            {
                R_FLASH_Write((uint32_t)load_firmware_control_block.flash_buffer, (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + load_firmware_control_block.offset, sizeof(load_firmware_control_block.flash_buffer));
                load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE;
            }
            else
            {
                load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
            }
            break;
        case FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case FIRMWARE_UPDATE_STATE_FINALIZE_COMPLETED:
            load_firmware_control_block.progress = 100;
            load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_COMPLETED;
            break;
        case FIRMWARE_UPDATE_STATE_COMPLETED:
            break;
        case FIRMWARE_UPDATE_STATE_ERROR:
            load_firmware_control_block.progress = 100;
            break;
        default:
            break;
    }
    return load_firmware_control_block.progress;
}

void flash_load_firmware_callback_function(void *event)
{
    uint32_t event_code;
    event_code = *((uint32_t*)event);

    switch(event_code)
    {
        case FLASH_INT_EVENT_ERASE_COMPLETE:
            if(FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE == load_firmware_control_block.status)
            {
                load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_READ_WAIT_COMPLETE;
            }
            else
            {
                load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
            }
            break;
        case FLASH_INT_EVENT_WRITE_COMPLETE:
            if(FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE == load_firmware_control_block.status)
            {
                load_firmware_control_block.offset += FLASH_CF_MEDIUM_BLOCK_SIZE;
                load_firmware_control_block.progress = (uint32_t)(((float)(load_firmware_control_block.offset)/(float)((FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))*100));

                if( load_firmware_control_block.firmware_length == load_firmware_control_block.offset )
                {
                    load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_COMPLETED;
                }
                else
                {
                    load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_READ_WAIT_COMPLETE;
                }
            }
            else
            {
                load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
            }
            break;
        case FLASH_INT_EVENT_TOGGLE_BANK:
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SWRR = 0xa501;
            while(1);   /* software reset */
            break;
        default:
            nop();
            break;
    }
}

static int16_t file_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset)
{
    flash_spi_info_t Flash_Info_W;
    flash_spi_status_t Ret = FLASH_SPI_SUCCESS;

    xSemaphoreTake(load_firmware_control_block.OTASemaphoreHandle, portMAX_DELAY);

    uint32_t internal_cnt = 0;

    do
    {
        Flash_Info_W.addr    = Offset + internal_cnt;
        Flash_Info_W.cnt     = SERIAL_FLASH_FIT_SIZE;
        Flash_Info_W.p_data  = (uint8_t *)&buf[internal_cnt];
        Flash_Info_W.op_mode = FLASH_SPI_SINGLE;
        Ret = R_FLASH_SPI_Write_Data_Page(0, &Flash_Info_W);
        if (FLASH_SPI_SUCCESS > Ret)
        {
            return -1;
        }
        while (FLASH_SPI_SUCCESS_BUSY == R_FLASH_SPI_Polling(0, FLASH_SPI_MODE_PROG_POLL))
        {
            vTaskDelay(5);
        }
        internal_cnt += SERIAL_FLASH_FIT_SIZE;
    }
    while (internal_cnt < write_size);

    xSemaphoreGive(load_firmware_control_block.OTASemaphoreHandle);

    return 0;
}

/* end of file */
